Repository: iberben/django-press-links
Catalog: press_links/locale/*/LC_MESSAGES/django.po
Languages: nl

source: Hidden
nl: Verborgen

source: author
nl: Auteur

source: title
nl: titel

source: publication date
nl: publicatiedatum

source: excerpt
nl: uittreksel

source: the source for the entry
nl: de bron voor het artikel

source: Sites where the entry is published
nl: De sites waar het artikel gepubliceerd is

source: Press Entry
nl: Persartikel

source: Press Entries
nl: Persartikels

source: text for link
nl: tekst voor de link

source: Entry
nl: Ingave

source: Press Link
nl: Pers Link

source: Press Links
nl: Pers Links

source: Press
nl: Pers

source: This page gives you an overview of our Mobile Vikings press releases, as well as the latest press articles related to Mobile Vikings.
nl: Deze pagina biedt een overzicht van onze Mobile Vikings press releases, alsook de nieuwste persberichten over Mobile Vikings.
